---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryConditionsIsExt
source: html/9f3c5eb1-1a21-3697-a0f7-688bed877642.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryConditionsIsExt Property

"Is Boundary Conditions External?"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryConditionsIsExt { get; }
```